# 1) შექმენი სია, სადაც შეინახავ შენს საყვარელ ფერებს.
color = ["blue" , "orange" ,"red"]

# 2) შექმენი სია, სადაც შეინახავ კვირის დღეებს.
week_days = ["monday", "tuesday" "wednesday" , "thursday", "friday","saturday", "sunday"]

# 3) შექმენი სია, სადაც შეინახავ 5 სხვადასხვა რიცხვს. -> დაბეჭდე მესამე ინდექსზე მყოფი ელემენტი
numbers = [10,15,25,40,50]
print(numbers[3])

# 4) შექმენი სია, სადაც შეინახავ 5 ქალაქის სახელს. -> შეცვალე მეორე ინდექსზე მყოფი ელემენტი სხვა ქალაქით
cities = ["სიღნაღი", "ქუთაისი", "თბილისი" , "თელავი" , "ბათუმი"]
cities[2] = "წყალტუბო"

# 5) შექმენი სია, სადაც შეინახავ შენი ოჯახის წევრების სახელებს. -> დაბეჭდე პირველი და ბოლო ელემენტი (ინდექსებით)
family = ["goga", "qristine" , "tamazi" ,"shorena"]
print(family[0])
print(family[3])

# 6) შექმენი სია, სადაც შეინახავ 6 სხვადასხვა რიცხვს. -> შეცვალე მეოთხე ინდექსზე მყოფი ელემენტი 100-ით
numbers = ["15","35", "40","55", "85" ,"110"]
numbers[4] = 100

# 7) შექმენი სია, სადაც შეინახავ 10 ძაღლის სახელს. -> შეცვალე მეხუთე ელემენტი სხვა თამაშით
dog_names = ["luna","bella","hank","lucy", "cooper","max", "charlie","milo","daisy" , "cooper"]
dog_names[4] = "bonnie"

# 8) შექმენი სია, სადაც შეინახავ 3 სტრინგს, 3 რიცხვს და 3 ბულეანს. -> დაბეჭდე ნებისმიერი ერთი ელემენტი ინდექსის გამოყენებით
mixed_type =["hello","goga","wednesday",15,30,50, True , False , False]
print(mixed_type[5])

# 9) შექმენი სია, სადაც შეინახავ 5 მუსიკოსის სახელს. -> თუ პირველი ელემენტი არის 'Drake' -> შეცვალე სხვა მუსიკოსით
musicians = ["michael jackson", "elvis presley" , "bob marley","billie eilish", "Drake"]
if musicians[0] == "Drake":
    musicians[0] = "taylor swift"

# 10) შექქმენი სია, სადაც შეინახავ რიცხვებს(როგორც მთელები ისე არამთელები) -> გაზარდე სიის პირველი და ბოლო ელემენტი 1000-ით
numbers = [10,9.5,15]
numbers[0] = numbers[0] + 1000
numbers[2] = numbers[2] + 1000

# 11) შექმენი სია, სადაც შეინახავ 3 რიცხვს(როგორც მთელები ისე არამთელები)
#  - თუ პირველი რიცხვი არის მეტი 10-ზე:
#      გაზარდე სიის მესამე ელემენტი პირველი და მეორე ელემენტის ნამრავლით
#  - სხვა შემთხვევაში:
#      გაზარდე სიის პირველი ელემენტი მეორე და მესამე ელემენტის ნამრავლით
numbers =[7.5,15,12]
if numbers[0] > 10:
    numbers[2] = numbers[2] + (numbers[0] * numbers[1])
else:
    numbers[0] = numbers[0] + (numbers[1] + numbers[2])


