#1) ახსენით რა არის Sequencing და Selection
# Sequencing - კოდის შესრულება ზემოდან ქვემოთ Selection - არჩევს მოქმედებას პირობის მიხედვით
#2) არის თუ არა საჭირო პითონში ინდენტაცია და სად ვიყენებთ მას?
# კი ინდენტაცია აუცილებელია , ინდენტაცია აჩვენებს რომელი კოდი რომელ ბლოკშია.
#3) მომხმარებელს შემოატანინე:
#--> მათემატიკის ქულა (math)  
#--> ინგლისურის ქულა (english)  
#--> ფიზიკის ქულა (physics)
#შემდეგ შეამოწმე:
#თუ math >= 90 და english >= 90 და physics >= 90 ->  
#- დაბეჭდე "შესანიშნავი მოსწავლე ხარ"  
#- დაბეჭდე "ყველა საგანში მაღალი შედეგი გაქვს"
#თუ math >= 70 და english >= 70 და physics >= 70 ->  
#- დაბეჭდე "კარგი შედეგებია"  
#- დაბეჭდე "სასწავლო წელი წარმატებულია"
#თუ math < 50 ან english < 50 ან physics < 50 ->  
#- დაბეჭდე ყველა საგანში მაღალი შედეგი გაქვს"  
#- დაბეჭდე "მეტი სწავლა დაგჭირდება"
#სხვა შემთხვევაში ->  
#- დაბეჭდე "შედეგები საშუალოა"  
#- დაბეჭდე "შეგიძლია უკეთესიც"
math = float(input("enter math score: "))
eng = float(input("enter english score: "))
phy = float(input("enter physics score: "))
if math >= 90 and eng >= 90 and phy >= 90:
    print("შესანიშნავი მოსწავლე ხარ")
    print("ყველა საგანში მაღალი შედეგი გაქვს")
elif math >= 70 and eng >= 90 and phy >= 90:
    print("კარგი შედეგებია")
    print("სასწავლო წელი წარმატებულია")
elif math < 50 or eng < 50 or phy < 50:
    print("ყველა საგანში მაღალი შედეგი გაქვს")
    print("მეტი სწავლა დაგჭირდება")
else:
    print("შედეგები საშუალოა")
    print("შეგიზლია უკეთესიც")

#4) მომხმარებელს შემოატანინე:
#--> ასაკი (age)  
#--> აქვს თუ არა მართვის მოწმობა (license) – "yes" ან "no"  
#--> არის თუ არა ალკოჰოლის ზემოქმედების ქვეშ (drunk) – "yes" ან "no"
#შემდეგ შეამოწმე:
#თუ age >= 18 და license == "yes" და drunk == "no" ->  
#- დაბეჭდე "შეგიძლია მანქანის მართვა"  
#- დაბეჭდე "უსაფრთხო მგზავრობას გისურვებთ"
#თუ age >= 18 და license == "no" და drunk == "no" ->  
#- დაბეჭდე "ასაკი საკმარისია"  
#- დაბეჭდე "მაგრამ მართვის მოწმობა არ გაქვს"
#თუ drunk == "yes" ან age < 18 ან license == "no" ->  
#- დაბეჭდე "მანქანის მართვა აკრძალულია"  
#- დაბეჭდე "ეს შეიძლება საშიში იყოს"
#სხვა შემთხვევაში ->  
#- დაბეჭდე "მონაცემები ვერ გადამოწმდა"  
#- დაბეჭდე "სცადე თავიდან"
age = float(input("age: "))
license = input("license (yes/no): ")
drunk = input("drunk (yes/no): ")

if age >= 18 and license == "yes" and drunk == "no":
    print("შეგიძლია მანქანის მართვა")
    print("უსაფრთხო მგზავრობას გისურვებთ")
elif age >= 18 and license == "no" and drunk == "no":
    print("ასაკი საკმარისია")
    print("მაგრამ მართვის მოწმობა არ გაქვს")
elif drunk == "yes" or age < 18 or license == "no":
    print("მანქანის მართვა აკრძალულია")
    print("ეს შეიძლება საშიში იყოს")
else:
    print("მონაცემები ვერ გადამოწმდა")
    print("სცადე თავიდან")

#5) მომხმარებელს შემოატანინე:
#--> პროდუქტის ფასი (price)  
#--> შეძენილი ნივთების რაოდენობა (quantity)  
#--> არის თუ არა მომხმარებელი წევრი (member) – "yes" ან "no"
#შემდეგ შეამოწმე:
#თუ price >= 100 და quantity >= 3 და member == "yes" ->  
#- დაბეჭდე "დიდი ფასდაკლება მიიღე"  
#- დაბეჭდე "მადლობა ერთგული მომხმარებლობისთვის"
#თუ price >= 100 და quantity >= 3 და member == "no" ->  
#- დაბეჭდე "ფასდაკლება მიიღო"  
#- დაბეჭდე "წევრობის შემთხვევაში უფრო მეტს მიიღებ"
#თუ price < 50 ან quantity == 1 ან member == "no" ->  
#- დაბეჭდე "ფასდაკლება არ გეკუთვნის"  
#- დაბეჭდე "მეტი პროდუქტი შეიძინე"
#სხვა შემთხვევაში ->  
#- დაბეჭდე "მცირე ფასდაკლება მიიღე"  
#- დაბეჭდე "გმადლობთ შენაძენისთვის"
price = float(input("product price: "))
quantity = int(input("quantity: "))
member = input("member (yes/no): ")
if price >= 100 and quantity >= 3 and member == "yes":
    print("დიდი ფასდაკლება მიიღე")
    print("მადლობა ერთგული მომხმარებლობისთვის")
elif price >= 100 and quantity >= 3 and member == "no":
    print("ფასდაკლება მიიღო")
    print("წევრობის შემთხვევაში უფრო მეტს მიიღებ")
elif price < 50 or quantity == 1 or member == "no":
    print("ფასდაკლება არ გეკუთვნის")
    print("მეტი პროდუქტი შეიძინე")
else:
    print("მცირე ფასდაკლება მიიღე")
    print("გმადლობთ შენაძენისთვის")

weight = float(input("weight (kg): "))
height = float(input("height (m): "))
age = int(input("age: "))
BMI = weight / (height * height)

if BMI < 18.5 and age >= 18:
    print("შენი BMI დაბალია")
    print("შესაძლოა წონის მომატება დაგჭირდეს")
elif 18.5 <= BMI <= 24.9 and age >= 18:
    print("შენი BMI ნორმალურია")
    print("ჯანმრთელ ფორმაში ხარ")

elif BMI >= 25 or age < 18:
    print("BMI საშუალოზე მაღალია")
    print("ჯანსაღი კვება მნიშვნელოვანია")
elif BMI >= 30:
    print("BMI მაღალია")
    print("სასურველია ექიმთან კონსულტაცია")
else:
    print("მონაცემები ვერ დამუშავდა")
    print("სცადე თავიდან")