# 1) ახსენით რა არის იტერაცია და როდის არის იგი საჭირო?
# იტერაცია ნიშნავს კოდის განმეორებით შესრულებას

# 2) ახსენით რა არის ალგორითმი და მოიყვანეთ მისი 3 მაგალითი რეალური ცხოვრებიდან
# ალგორითმი ნიშნავს რაიმე ნაბიჯების თანმიმდევრობით მიყოლას , მაგალითად: სკოლაში წასვლა, საჭმლის გაკეთება და კბილების გახეხვა

# 3) ჩამოთვალეთ ალგორითმების აღწერის ხერხები
# ნატურალური ენით, pseudocode-ით, flowchart-ით

# 4) for loop ის გამოყენებით დაპრინტეთ სტრინგი 'for loop' 25 ჯერ
for i in range(25):
    print("for loop")

# 5) for loop ის გამოყენებით დაპრინტეთ რიცხვები 25 დან 75 ჩათვლით
for i in range(25, 76):
    print(i)

# 6) for loop ის გამოყენებით დაპრინტეთ რიცხვები 40 დან 90 მდე
for i in range(40 , 90):
    print(i)

# 7) for loop ის გამოყენებით დაპრინტეთ რიცხვები 25 დან 150 ჩათვლით 4 ის გამოტოვებით
for i in range(25, 151, 4):
    print(i)

# 8) for loop ის გამოყენებით დაპრინტეთ რიცხვები 100 დან 1000 ჩათვლით 10 ის გამოტოვებით
for i in range (100, 1001, 10):
    print(i)

#9) for loop ის გამოყენებით დაპრინტეთ მსგავსი რამ:
# 1 პითონი მაგარია
# 2 პითონი მაგარია
# 3 პითონი მაგარია
# ...
# 100 პითონი მაგარია

for i in range (101):
    print (str(i) + " goga")


