# 1) 0 დან 100 მდე დაპრინტეთ ყველა რიცხვი .
for i in range(100):
    print (i)

# 2) 40 დან 250 ის ჩათვლით დაპრინტეთ  ყველა ლუწი რიცხვი
for i in range (40,251, 2):
    print (i)

# 3) 200 დან 400 მდე დაპრინტეთ ყველა 5 ის და 4 ის ჯერადი რიცხვი .
for i in range (200,400):
    if i % 5 == 0 and i % 4 == 0:
        print (i)

# 4) მომხმარებელს შემოატანინეთ რიცხვი და 2 დან ამ რიცხვის ჩათვლით დაპრინტეთ ყველა რიცხვი.
number = int(input("შეიყვანეთ რიცხვი: "))
for i in range (2, number + 1 ):
    print (i)

# 5) მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0 მდე დაპრინტეთ ყველა რიცხვი უკუსვლით.
num = int(input("შეიყვანეთ რიცხვი "))
for i in reversed(range(0 , num + 1)):
    print (i)

# 6) რიცხვის გამოცნობა -> შექმენით number ცვლადი და შეინახეთ რაიმე რიცხვი.
#  მომხმარებელს შემოატანინეთ რიცხვი მანამ სანამ თქვენს მიერ ჩაფიქრებულ რიცხვს არ შემოიტანს.
number = 6
guess = int(input("გამოიცანით რიცხვი: "))
while guess != number:
    guess = int(input("გამოიცანით რიცხვი: "))
if guess != number:
    print("არასწორია")
else:
    print("სწორად გამოიცანი!")




