#1) მომხმარებელს შემოატანინე ტემპერატურა (რიცხვი) და შემდეგ შეამოწმე:
#თუ ტემპერატურა მეტია 30-ზე -> დაბეჭდე "ძალიან ცხელა!"
#თუ ტემპერატურა მეტია 20-ზე -> დაბეჭდე "სასიამოვნო ამინდია"
#თუ ტემპერატურა მეტია 10-ზე -> დაბეჭდე "ცოტა ცივა"
#თუ ტემპერატურა მეტია 0-ზე -> დაბეჭდე "ცივა, ჩაიცვი თბილად"
#სხვა შემთხვევაში -> "გაიყინები, სახლში დარჩი!"
temp = int(input("შეიყვანეთ ტემპერატურა: "))
if temp > 30:
    print("ძალიან ცხელა")
elif temp > 20:
    print("სასიამოვნო ამინდია")
elif temp > 10:
    print("ცოტა ცივა")
elif temp > 0:
    print("ცივა, ჩაიცვი თბილად")
else:
    print("გაიყინები, სახლში დარჩი")

#2) მომხმარებელს შემოატანინე ორი რიცხვი:
#--> ქულა (score)
#--> დასწრება (attendance პროცენტებში)
#შემდეგ შეამოწმე:
#თუ ქულა მეტია 80-ზე და დასწრება მეტია 90-ზე -> "შენ შესანიშნავად დაწერე გამოცდა"
#თუ ქულა მეტია 50-ზე და დასწრება მეტია 70-ზე -> "საშუალოდ დაწერე გამოცდა"
#თუ ქულა მეტია 30-ზე ან დასწრება მეტია 50-ზე -> "გაჭირვებით, მაგრამ ჩააბარე გამოცდა"
#ყველა სხვა შემთხვევაში → "ჩაიჭერი!"
score = float(input("შეიყვანე ქულა: "))
attend = float(input("შეიყვანე დასწრება (%): "))
if score > 80 and attend > 90:
    print("შენ შესანიშნაავდ დაწერე გამოცდა")
elif score > 50 and attend > 70:
    print("საშუალოდ დაწერე გამოცდა")
elif score > 30 or attend > 50:
    print("გაჭირვებით, მაგრამ ჩააბარე გამოცდა")
else:
    print("ჩაიჭერი!")

#3) მომხმარებელს შემოატანინე:
#--> ტემპერატურა (temp)
#--> არის თუ არა წვიმა (rain) – მომხმარებელმა შეიყვანოს "yes" ან "no"
#შემდეგ შეამოწმე:
#თუ ტემპერატურა მეტია 25-ზე და rain == "no" -> "შესანიშნავი ამინდია სასეირნოდ!"
#თუ ტემპერატურა მეტია 25-ზე და rain == "yes" -> "ცხელი და წვიმიანია, ჩაფხუტი დაგჭირდება!"
#თუ ტემპერატურა ნაკლებია 10-ზე ან rain == "yes" -> "სჯობს სახლში დარჩე"
#სხვა შემთხვევაში -> "სასიამოვნო ამინდია"
temp = float(input("შეიყვანე ტემპერატურა: "))
rain = input("წვიმს? (yes/no): ") 
if temp > 25 and rain == "no":
    print("შესანიშნავი ამინდია სასეირნოდ!")
elif temp > 25 and rain == "yes":
    print("ცხელი და წვიმიანია, ჩაფხუტი დაგჭირდება!")
elif temp < 10 or rain == "yes":
    print("სჯობს სახლში დარჩე")
else:
    print("სასიამოვნო ამინდია")

#4) მომხმარებელს შემოატანინე:
#--> ასაკი (age)
#--> სტუდენტია თუ არა (student) – შეიყვანოს "yes" ან "no"
#შემდეგ:
#თუ ასაკი ნაკლებია 12-ზე ან მეტია 65-ზე -> "ბილეთი უფასოა"
#თუ student == "yes" და ასაკი მეტია 12-ზე -> "ბილეთი ნახევარ ფასად"
#სხვა შემთხვევაში -> "სრული ფასი უნდა გადაიხადო"
age = int(input("Enter age: "))
student = input("Are you a student? (yes/no): ")
if age < 12 or age > 65:
    print("ბილეთი უფასა")
elif student == "yes" and age > 12:
    print("ბილეთი ნახევარ ფასად")
else:
    print("სრული ფასი უნდა გადაიხადო")

#5) მომხმარებელს შემოატანინე:
#--> მომხმარებლის სახელი (username)
#--> პაროლი (password)
#შეამოწმე:
#თუ მომხმარებელი არის "admin" და პაროლი არის 'superSecretPassword' → "მოგესალმები, ადმინ!"
#თუ მომხმარებელი "guest" და პაროლი არის "1234" → "მოგესალმები, სტუმარო!"
#სხვა შემთხვევაში → "მომხმარებელი არ მოიძებნა!"
name = input("შეიყვანეთ თქვენი სახელი: ")
password = input("შეიყვანეთ პაროლი: ")
if name == "admin" and password == "superSecretPassword":
    print("მოგესალმები, ადმინ!")
elif name == "guest" and password == "1234":
    print("მოგესალმები, სტუმარო")
else:
    print("მომხმარებელი არ მოიძებნა!")